//8. 현금을 입력 받아 큰 단위 화폐 위주로 각 단위의 개수를 구하시오.
//(예: 108, 000원 = > 50000원권 2개, 5000원권 1개, 1000원권 3개)
#include <stdio.h>
int main() {
	int m;
	scanf_s("%d", &m);
	int a[4];
		a[0] = m / 50000; 
		a[1] = (m-a[0]*50000)/10000; 
		a[2] = (m - a[0] * 50000 - a[1] * 10000)/5000;;
		a[3] = (m - a[0] * 50000 - a[1] * 10000 - a[2] * 5000)/1000; 
		if (a[0] != 0) printf("5만원권 %d개, ", a[0]);
		if (a[1] != 0) printf("1만원권 %d개, ", a[1]);
		if (a[2] != 0) printf("5천원권 %d개, ", a[2]);
		if (a[3] != 0) printf("1천원권 %d개, ", a[3]);

	
}
